pisppus/PipKit/lib/PipKit/PipCore/Platforms/ESP32/Transports/StSpiTransport.cpp
#include <PipCore/Features.hpp>

#if PIPCORE_TARGET_ESP32

#include <PipCore/Platforms/ESP32/Transports/StSpiTransport.hpp>

#include <sdkconfig.h>
#include <esp_heap_caps.h>
#include <esp_attr.h>
#include <driver/spi_master.h>
#include <driver/gpio.h>
#include <hal/gpio_ll.h>
#include <esp_rom_gpio.h>
#include <esp_rom_sys.h>

#if __has_include(<esp_memory_utils.h>)
#include <esp_memory_utils.h>
#endif
#if __has_include(<soc/soc_memory_layout.h>)
#include <soc/soc_memory_layout.h>
#endif

#include <freertos/FreeRTOS.h>
#include <freertos/task.h>

#include <PipCore/Debug/MemoryHooks.hpp>

#include <cstring>
#include <algorithm>

namespace pipcore::esp32
{
    namespace
    {
        [[nodiscard]] inline constexpr bool isPinValid(int8_t pin) noexcept { return pin >= 0; }

        inline void IRAM_ATTR fastFill32(uint32_t *dest, size_t words, uint32_t value) noexcept
        {
            size_t blocks = words >> 3;
            while (blocks--)
            {
                dest[0] = value;
                dest[1] = value;
                dest[2] = value;
                dest[3] = value;
                dest[4] = value;
                dest[5] = value;
                dest[6] = value;
                dest[7] = value;
                dest += 8;
            }

            size_t remainder = words & 7U;
            while (remainder--)
            {
                *dest++ = value;
            }
        }

        [[nodiscard]] inline bool isDmaCapable(const void *p) noexcept
        {
#if defined(CONFIG_IDF_TARGET_ESP32S3)
            return esp_ptr_internal(p) || esp_ptr_dma_ext_capable(p);
#else
            return esp_ptr_dma_capable(p);
#endif
        }

        inline void IRAM_ATTR gpio_fast_write_high(int8_t pin) noexcept
        {
            if (__builtin_expect(pin < 32, 1))
            {
                GPIO.out_w1ts = (1UL << pin);
            }
            else
            {
                gpio_ll_set_level(&GPIO, static_cast<gpio_num_t>(pin), 1);
            }
        }

        inline void IRAM_ATTR gpio_fast_write_low(int8_t pin) noexcept
        {
            if (__builtin_expect(pin < 32, 1))
            {
                GPIO.out_w1tc = (1UL << pin);
            }
            else
            {
                gpio_ll_set_level(&GPIO, static_cast<gpio_num_t>(pin), 0);
            }
        }

        void IRAM_ATTR lcd_spi_pre_cb(spi_transaction_t *t)
        {
            const uint32_t packed = static_cast<uint32_t>(reinterpret_cast<uintptr_t>(t->user));
            const int8_t pin = static_cast<int8_t>(packed >> 8);
            const uint8_t level = static_cast<uint8_t>(packed);

            if (pin >= 0)
            {
                if (level)
                {
                    if (__builtin_expect(pin < 32, 1))
                    {
                        GPIO.out_w1ts = (1UL << pin);
                    }
                    else
                    {
                        gpio_ll_set_level(&GPIO, static_cast<gpio_num_t>(pin), 1);
                    }
                }
                else
                {
                    if (__builtin_expect(pin < 32, 1))
                    {
                        GPIO.out_w1tc = (1UL << pin);
                    }
                    else
                    {
                        gpio_ll_set_level(&GPIO, static_cast<gpio_num_t>(pin), 0);
                    }
                }
            }
        }

        [[nodiscard]] inline void *packDcInfo(int8_t pin, uint8_t level) noexcept
        {
            const uint32_t packed = (static_cast<uint32_t>(static_cast<uint8_t>(pin)) << 8) | level;
            return reinterpret_cast<void *>(static_cast<uintptr_t>(packed));
        }

        [[nodiscard]] constexpr int8_t resolveDefaultMosi() noexcept
        {
#if defined(CONFIG_IDF_TARGET_ESP32)
            return 13;
#elif defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)
            return 11;
#elif defined(CONFIG_IDF_TARGET_ESP32C2) || defined(CONFIG_IDF_TARGET_ESP32C3) || \
    defined(CONFIG_IDF_TARGET_ESP32C6) || defined(CONFIG_IDF_TARGET_ESP32H2)
            return 7;
#else
            return -1;
#endif
        }

        [[nodiscard]] constexpr int8_t resolveDefaultSclk() noexcept
        {
#if defined(CONFIG_IDF_TARGET_ESP32)
            return 14;
#elif defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)
            return 12;
#elif defined(CONFIG_IDF_TARGET_ESP32C2) || defined(CONFIG_IDF_TARGET_ESP32C3) || \
    defined(CONFIG_IDF_TARGET_ESP32C6) || defined(CONFIG_IDF_TARGET_ESP32H2)
            return 6;
#else
            return -1;
#endif
        }

        [[nodiscard]] constexpr int8_t resolveDefaultCs() noexcept
        {
#if defined(CONFIG_IDF_TARGET_ESP32)
            return 15;
#elif defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3) || \
    defined(CONFIG_IDF_TARGET_ESP32C2) || defined(CONFIG_IDF_TARGET_ESP32C3) ||   \
    defined(CONFIG_IDF_TARGET_ESP32C6) || defined(CONFIG_IDF_TARGET_ESP32H2)
            return 10;
#else
            return -1;
#endif
        }
    }

    void StSpiTransport::configure(int8_t mosi, int8_t sclk, int8_t cs, int8_t dc, int8_t rst, uint32_t hz) noexcept
    {
        deinit();

        _pinMosi = isPinValid(mosi) ? mosi : resolveDefaultMosi();
        _pinSclk = isPinValid(sclk) ? sclk : resolveDefaultSclk();
        _pinCs = isPinValid(cs) ? cs : resolveDefaultCs();

        _pinDc = dc;
        _pinRst = rst;
        _hz = hz ? hz : 80000000U;

        _spiHandle = nullptr;
        _dmaBuf[0] = nullptr;
        _dmaBuf[1] = nullptr;
        _busAcquired = false;
        _initialized = false;
        _lastError = st::IoError::None;

        std::memset(_asyncTrans, 0, sizeof(_asyncTrans));

        _asyncNext = 0;
        _asyncInFlight = 0;

        _lastXs = 0xFFFF;
        _lastXe = 0xFFFF;
        _lastYs = 0xFFFF;
        _lastYe = 0xFFFF;
    }

    StSpiTransport::~StSpiTransport()
    {
        StSpiTransport::deinit();
    }

    bool StSpiTransport::fail(st::IoError error)
    {
        _lastError = error;
        return false;
    }

    bool StSpiTransport::init()
    {
        clearError();
        if (_initialized)
            return true;

        if (__builtin_expect(!isPinValid(_pinDc), 0))
            return fail(st::IoError::InvalidConfig);

