pisppus/PipKit/lib/PipKit/PipCore/Platforms/ESP32/Transports/StSpiTransport.cpp
        if (__builtin_expect(!initSpi(), 0))
            return false;

        gpio_config_t io{};
        io.intr_type = GPIO_INTR_DISABLE;
        io.mode = GPIO_MODE_OUTPUT;
        io.pull_down_en = GPIO_PULLDOWN_DISABLE;
        io.pull_up_en = GPIO_PULLUP_DISABLE;
        io.pin_bit_mask = 1ULL << (uint8_t)_pinDc;

        if (isPinValid(_pinRst))
            io.pin_bit_mask |= 1ULL << (uint8_t)_pinRst;

        if (__builtin_expect(gpio_config(&io) != ESP_OK, 0))
        {
            StSpiTransport::deinit();
            return fail(st::IoError::Gpio);
        }

        _initialized = true;
        return true;
    }

    void StSpiTransport::deinit()
    {
        if (_spiHandle)
        {
            (void)waitComplete();
            spi_bus_remove_device((spi_device_handle_t)_spiHandle);
            spi_bus_free(SPI2_HOST);
            _spiHandle = nullptr;
        }

        for (int i = 0; i < 2; ++i)
        {
            if (_dmaBuf[i])
            {
                void *freed = _dmaBuf[i];
                heap_caps_free(_dmaBuf[i]);
                _dmaBuf[i] = nullptr;
                pipcore::debug::memoryEvent(pipcore::debug::MemoryEvent::Free, "st.dma.free", freed, nullptr, DmaBufferBytes, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
            }
        }

        _busAcquired = false;
        _initialized = false;
        _asyncNext = 0;
        _asyncInFlight = 0;
    }

    bool StSpiTransport::initSpi()
    {
        if (_spiHandle)
            return true;

        if (__builtin_expect(!isPinValid(_pinMosi) || !isPinValid(_pinSclk), 0))
            return fail(st::IoError::InvalidConfig);

        spi_bus_config_t bus{};
        bus.mosi_io_num = _pinMosi;
        bus.miso_io_num = -1;
        bus.sclk_io_num = _pinSclk;
        bus.quadwp_io_num = -1;
        bus.quadhd_io_num = -1;
        bus.max_transfer_sz = static_cast<int>(HardwareMaxDmaBytes);
#if defined(CONFIG_SPI_MASTER_ISR_IN_IRAM)
        bus.intr_flags = ESP_INTR_FLAG_IRAM;
#endif

        if (__builtin_expect(spi_bus_initialize(SPI2_HOST, &bus, SPI_DMA_CH_AUTO) != ESP_OK, 0))
            return fail(st::IoError::SpiBusInit);

        spi_device_interface_config_t dev{};
        dev.mode = 0;
        dev.clock_speed_hz = static_cast<int>(_hz);
        dev.spics_io_num = isPinValid(_pinCs) ? _pinCs : -1;
        dev.flags = SPI_DEVICE_NO_DUMMY | SPI_DEVICE_HALFDUPLEX;
        dev.queue_size = MaxAsyncTrans;
        dev.pre_cb = lcd_spi_pre_cb;

        spi_device_handle_t h = nullptr;
        if (__builtin_expect(spi_bus_add_device(SPI2_HOST, &dev, &h) != ESP_OK, 0))
        {
            spi_bus_free(SPI2_HOST);
            return fail(st::IoError::SpiDeviceAdd);
        }
        _spiHandle = h;

        for (int i = 0; i < 2; ++i)
        {
            _dmaBuf[i] = static_cast<uint8_t *>(heap_caps_aligned_alloc(16, DmaBufferBytes, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL));
            pipcore::debug::memoryEvent(_dmaBuf[i] ? pipcore::debug::MemoryEvent::Alloc : pipcore::debug::MemoryEvent::AllocFail,
                                        "st.dma.alloc", _dmaBuf[i], nullptr, DmaBufferBytes, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
            if (!_dmaBuf[i])
            {
                deinit();
                return fail(st::IoError::DmaBufferAlloc);
            }
        }

        std::memset(_asyncTrans, 0, sizeof(_asyncTrans));

        _asyncTrans[0].user = packDcInfo(_pinDc, 1);
        _asyncTrans[1].user = packDcInfo(_pinDc, 1);

        std::memset(_addrTrans, 0, sizeof(_addrTrans));

        _addrTrans[0].flags = SPI_TRANS_USE_TXDATA;
        _addrTrans[0].length = 8;
        _addrTrans[0].tx_data[0] = 0x2A;
        _addrTrans[0].user = packDcInfo(_pinDc, 0);

        _addrTrans[1].flags = SPI_TRANS_USE_TXDATA;
        _addrTrans[1].length = 32;
        _addrTrans[1].user = packDcInfo(_pinDc, 1);

        _addrTrans[2].flags = SPI_TRANS_USE_TXDATA;
        _addrTrans[2].length = 8;
        _addrTrans[2].tx_data[0] = 0x2B;
        _addrTrans[2].user = packDcInfo(_pinDc, 0);

        _addrTrans[3].flags = SPI_TRANS_USE_TXDATA;
        _addrTrans[3].length = 32;
        _addrTrans[3].user = packDcInfo(_pinDc, 1);

        _addrTrans[4].flags = SPI_TRANS_USE_TXDATA;
        _addrTrans[4].length = 8;
        _addrTrans[4].tx_data[0] = 0x2C;
        _addrTrans[4].user = packDcInfo(_pinDc, 0);

        _busAcquired = false;
        _asyncNext = 0;
        _asyncInFlight = 0;

        _lastXs = 0xFFFF;
        _lastXe = 0xFFFF;
        _lastYs = 0xFFFF;
        _lastYe = 0xFFFF;

        clearError();
        return true;
    }

    bool StSpiTransport::setRst(bool level)
    {
        if (isPinValid(_pinRst))
        {
            if (level)
                gpio_fast_write_high(_pinRst);
            else
                gpio_fast_write_low(_pinRst);
        }
        return true;
    }

    void StSpiTransport::delayMs(uint32_t ms)
    {
        vTaskDelay(pdMS_TO_TICKS(ms));
    }

    bool IRAM_ATTR StSpiTransport::writeCommand(uint8_t cmd)
    {
        if (__builtin_expect(!_spiHandle, 0))
            return fail(st::IoError::NotReady);

        if (_asyncInFlight > 0)
        {
            if (__builtin_expect(!drainQueue(), 0))
                return false;
        }

        spi_transaction_t t{};
        t.flags = SPI_TRANS_USE_TXDATA;
        t.length = 8;
        t.user = packDcInfo(_pinDc, 0);
        t.tx_data[0] = cmd;

        if (__builtin_expect(spi_device_polling_transmit(static_cast<spi_device_handle_t>(_spiHandle), &t) != ESP_OK, 0))
            return fail(st::IoError::CommandTransmit);

        return true;
    }

    bool IRAM_ATTR StSpiTransport::write(const void *data, size_t len)
    {
        if (__builtin_expect(!len || !_spiHandle, 0))
            return fail(st::IoError::NotReady);

        if (_asyncInFlight > 0)
        {
            if (__builtin_expect(!drainQueue(), 0))
                return false;
        }

        spi_transaction_t t{};
        t.user = packDcInfo(_pinDc, 1);
        t.length = static_cast<int>(len << 3);

        if (len <= 4U)
        {
            t.flags = SPI_TRANS_USE_TXDATA;
            std::memcpy(t.tx_data, data, len);
        }
        else
        {
            t.tx_buffer = data;
        }

