pisppus/PipKit/lib/PipKit/PipCore/Platforms/ESP32/Transports/StSpiTransport.cpp
        if (__builtin_expect(spi_device_polling_transmit(static_cast<spi_device_handle_t>(_spiHandle), &t) != ESP_OK, 0))
            return fail(st::IoError::DataTransmit);

        return true;
    }

    bool IRAM_ATTR StSpiTransport::acquireBus()
    {
        _busAcquired = true;
        return true;
    }

    void StSpiTransport::releaseBus()
    {
        _busAcquired = false;
    }

    bool IRAM_ATTR StSpiTransport::waitOldest()
    {
        if (_asyncInFlight <= 0)
            return true;

        spi_transaction_t *r = nullptr;

        esp_err_t err = spi_device_get_trans_result(static_cast<spi_device_handle_t>(_spiHandle), &r, portMAX_DELAY);

        if (__builtin_expect(err != ESP_OK || !r, 0))
        {
            _asyncNext = 0;
            _asyncInFlight = 0;
            return fail(st::IoError::QueueResult);
        }

        _asyncInFlight--;
        return true;
    }

    bool IRAM_ATTR StSpiTransport::drainQueue()
    {
        if (__builtin_expect(!_spiHandle, 0))
            return true;

        bool success = true;

        while (_asyncInFlight > 0)
        {
            spi_transaction_t *r = nullptr;
            esp_err_t err = spi_device_get_trans_result(static_cast<spi_device_handle_t>(_spiHandle), &r, portMAX_DELAY);

            if (__builtin_expect(err != ESP_OK || !r, 0))
            {
                success = false;
            }
            _asyncInFlight--;
        }

        _asyncNext = 0;
        _asyncInFlight = 0;

        return success;
    }

    bool IRAM_ATTR StSpiTransport::writeAddrWindow(uint16_t xs, uint16_t xe, uint16_t ys, uint16_t ye)
    {
        if (_asyncInFlight > 0)
        {
            if (__builtin_expect(!drainQueue(), 0))
                return false;
        }

        if (__builtin_expect(!acquireBus(), 0))
            return false;

        if (xs == _lastXs && xe == _lastXe && ys == _lastYs && ye == _lastYe)
        {
            spi_device_handle_t handle = static_cast<spi_device_handle_t>(_spiHandle);
            if (__builtin_expect(spi_device_polling_transmit(handle, &_addrTrans[4]) != ESP_OK, 0))
                return fail(st::IoError::CommandTransmit);

            return true;
        }

        _lastXs = xs;
        _lastXe = xe;
        _lastYs = ys;
        _lastYe = ye;

        _addrTrans[1].tx_data[0] = xs >> 8;
        _addrTrans[1].tx_data[1] = xs & 0xFF;
        _addrTrans[1].tx_data[2] = xe >> 8;
        _addrTrans[1].tx_data[3] = xe & 0xFF;

        _addrTrans[3].tx_data[0] = ys >> 8;
        _addrTrans[3].tx_data[1] = ys & 0xFF;
        _addrTrans[3].tx_data[2] = ye >> 8;
        _addrTrans[3].tx_data[3] = ye & 0xFF;

        spi_device_handle_t handle = static_cast<spi_device_handle_t>(_spiHandle);

        if (__builtin_expect(spi_device_polling_transmit(handle, &_addrTrans[0]) != ESP_OK, 0))
            return fail(st::IoError::CommandTransmit);
        if (__builtin_expect(spi_device_polling_transmit(handle, &_addrTrans[1]) != ESP_OK, 0))
            return fail(st::IoError::CommandTransmit);
        if (__builtin_expect(spi_device_polling_transmit(handle, &_addrTrans[2]) != ESP_OK, 0))
            return fail(st::IoError::CommandTransmit);
        if (__builtin_expect(spi_device_polling_transmit(handle, &_addrTrans[3]) != ESP_OK, 0))
            return fail(st::IoError::CommandTransmit);
        if (__builtin_expect(spi_device_polling_transmit(handle, &_addrTrans[4]) != ESP_OK, 0))
            return fail(st::IoError::CommandTransmit);

        return true;
    }

    bool IRAM_ATTR StSpiTransport::writePixelsImpl(const void *data, size_t len, bool useDmaBufferIfNonCapable)
    {
        if (__builtin_expect(!len || !_spiHandle, 0))
            return fail(st::IoError::NotReady);

        if (__builtin_expect(!acquireBus(), 0))
            return false;

        const uint8_t *p = static_cast<const uint8_t *>(data);
        size_t remaining = len;

        const bool directDma = isDmaCapable(p) && ((reinterpret_cast<uintptr_t>(p) & 3U) == 0U);

        if (directDma || !useDmaBufferIfNonCapable)
        {
            if (__builtin_expect(remaining <= HardwareMaxDmaBytes, 1))
            {
                while (_asyncInFlight >= MaxAsyncTrans)
                {
                    if (__builtin_expect(!waitOldest(), 0))
                        return false;
                }

                spi_transaction_t *t = &_asyncTrans[_asyncNext];
                t->flags = 0;
                t->length = static_cast<int>(remaining << 3);
                t->rxlength = 0;
                t->tx_buffer = p;

                esp_err_t err = spi_device_queue_trans(static_cast<spi_device_handle_t>(_spiHandle), t, portMAX_DELAY);
                if (__builtin_expect(err != ESP_OK, 0))
                    return fail(st::IoError::QueueTransmit);

                _asyncNext ^= 1;
                _asyncInFlight++;
                return true;
            }

            while (remaining > 0)
            {
                while (_asyncInFlight >= MaxAsyncTrans)
                {
                    if (__builtin_expect(!waitOldest(), 0))
                        return false;
                }

                const size_t chunk = std::min(remaining, HardwareMaxDmaBytes);
                spi_transaction_t *t = &_asyncTrans[_asyncNext];

                t->flags = 0;
                t->length = static_cast<int>(chunk << 3);
                t->rxlength = 0;
                t->tx_buffer = p;

                esp_err_t err = spi_device_queue_trans(static_cast<spi_device_handle_t>(_spiHandle), t, portMAX_DELAY);
                if (__builtin_expect(err != ESP_OK, 0))
                    return fail(st::IoError::QueueTransmit);

                _asyncNext ^= 1;
                _asyncInFlight++;

                p += chunk;
                remaining -= chunk;
            }
            return true;
        }
        else
        {
            if (__builtin_expect(!_dmaBuf[0] || !_dmaBuf[1], 0))
                return fail(st::IoError::NotReady);

            if (__builtin_expect(remaining <= DmaBufferBytes, 1))
            {
                while (_asyncInFlight >= MaxDmaBufs)
                {
                    if (__builtin_expect(!waitOldest(), 0))
                        return false;
                }

                std::memcpy(_dmaBuf[_asyncNext], p, remaining);

                spi_transaction_t *t = &_asyncTrans[_asyncNext];
                t->flags = 0;
                t->length = static_cast<int>(remaining << 3);
                t->rxlength = 0;
                t->tx_buffer = _dmaBuf[_asyncNext];

                esp_err_t err = spi_device_queue_trans(static_cast<spi_device_handle_t>(_spiHandle), t, portMAX_DELAY);
                if (__builtin_expect(err != ESP_OK, 0))
                    return fail(st::IoError::QueueTransmit);

                _asyncNext ^= 1;
                _asyncInFlight++;
                return true;
            }

